  [
    "A male barber shaves all and only those men who do not shave themselves. Does he shave himself?",
    "The thesis that there are some things which are unnameable conflicts with the notion that something is named by calling it unnameable.",
    "The phrase \"the first number not nameable in under ten words\" appears to name it in nine words.",
    "If a crocodile steals a child and promises its return if the father can correctly guess exactly what the crocodile will do, how should the crocodile respond in the case that the father guesses that the child will not be returned?",
    "A law student agrees to pay his teacher after (and only after) winning his first case. The teacher then sues the student (who has not yet won a case) for payment.",
    "\"If this sentence is true, then Santa Claus exists.\"",
    "A Cretan named Zan says: \"All Cretans are liars\". Then who lies? Zan or the Cretans?",
    "Is the word \"heterological\", meaning \"not applicable to itself\", a heterological word?",
    "If there was a name for a natural number that is identical to a name of the successor of that number, there would be a natural number equal to its successor.",
    "\"This sentence is not known.\"",
    "\"This sentence is false.\"",
    "\"Is the answer to this question 'no'?\"",
    "\"I'm lying.\"",
    "\"The next statement is true. The previous statement is false.\"",
    "What would happen if Pinocchio said \"My nose grows now\"? Will it grow or not?",
    "Does the set of all those sets that do not contain themselves contain itself?",
    "\"I know that I know nothing\" Then do I know anything?",
    "It seems like one can replace any component of a ship, and it is still the same ship. So they can replace them all, one at a time, and it is still the same ship. However, they can then take all the original pieces, and assemble them into a ship. That, too, is the same ship they began with.",
    "If one removes a single grain of sand from a heap, they still have a heap. If they keep removing single grains, the heap will disappear. Can a single grain of sand make the difference between heap and non-heap?",
    "It begins with the great hero Achilles challenging a tortoise to a footrace. To keep things fair, he agrees to give the tortoise a head start of, say, 500m. When the race begins, Achilles unsurprisingly starts running at a speed much faster than the tortoise, so that by the time he has reached the 500m mark, the tortoise has only walked 50m further than him. But by the time Achilles has reached the 550m mark, the tortoise has walked another 5m. And by the time he has reached the 555m mark, the tortoise has walked another 0.5m, then 0.25m, then 0.125m, and so on. This process continues again and again over an infinite series of smaller and smaller distances, with the tortoise always moving forwards while Achilles always plays catch up. Thus, Achilles can never run past the tortoise.",
    "Imagine that a time traveller buys a copy of Hamlet from a bookstore, travels back in time to Elizabethan London, and hands the book to Shakespeare, who then copies it out and claims it as his own work. Over the centuries that follow, Hamlet is reprinted and reproduced countless times until finally a copy of it ends up back in the same original bookstore, where the time traveller finds it, buys it, and takes it back to Shakespeare. Who, then, wrote Hamlet?",
    "Imagine that a family has two children, one of whom we know to be a boy. What then is the probability that the other child is a boy? The obvious answer is to say that the probability is 1/2—after all, the other child can only be either a boy or a girl, and the chances of a baby being born a boy or a girl are (essentially) equal. In a two-child family, however, there are actually four possible combinations of children: two boys (MM), two girls (FF), an older boy and a younger girl (MF), and an older girl and a younger boy (FM). We already know that one of the children is a boy, meaning we can eliminate the combination FF, but that leaves us with three equally possible combinations of children in which at least one is a boy—namely MM, MF, and FM. This means that the probability that the other child is a boy—MM—must be 1/3, not 1/2.",
    "Imagine you’re holding a postcard in your hand, on one side of which is written, “The statement on the other side of this card is true.” We’ll call that Statement A. Turn the card over, and the opposite side reads, “The statement on the other side of this card is false” (Statement B). Trying to assign any truth to either Statement A or B, however, leads to a paradox: if A is true then B must be as well, but for B to be true, A has to be false. Oppositely, if A is false then B must be false too, which must ultimately make A true.",
    "A crocodile snatches a young boy from a riverbank. His mother pleads with the crocodile to return him, to which the crocodile replies that he will only return the boy safely if the mother can guess correctly whether or not he will indeed return the boy. There is no problem if the mother guesses that the crocodile will return him—if she is right, he is returned; if she is wrong, the crocodile keeps him. If she answers that the crocodile will not return him, however, we end up with a paradox: if she is right and the crocodile never intended to return her child, then the crocodile has to return him, but in doing so breaks his word and contradicts the mother’s answer. On the other hand, if she is wrong and the crocodile actually did intend to return the boy, the crocodile must then keep him even though he intended not to, thereby also breaking his word.",
    "Imagine that you’re about to set off walking down a street. To reach the other end, you’d first have to walk half way there. And to walk half way there, you’d first have to walk a quarter of the way there. And to walk a quarter of the way there, you’d first have to walk an eighth of the way there. And before that a sixteenth of the way there, and then a thirty-second of the way there, a sixty-fourth of the way there, and so on. Ultimately, in order to perform even the simplest of tasks like walking down a street, you’d have to perform an infinite number of smaller tasks—something that, by definition, is utterly impossible.",
    "Imagine a fletcher (i.e. an arrow-maker) has fired one of his arrows into the air. For the arrow to be considered to be moving, it has to be continually repositioning itself from the place where it is now to any place where it currently isn’t. The Fletcher’s Paradox, however, states that throughout its trajectory the arrow is actually not moving at all. At any given instant of no real duration (in other words, a snapshot in time) during its flight, the arrow cannot move to somewhere it isn’t because there isn’t time for it to do so. And it can’t move to where it is now, because it’s already there. So, for that instant in time, the arrow must be stationary. But because all time is comprised entirely of instants—in every one of which the arrow must also be stationary—then the arrow must in fact be stationary the entire time. Except, of course, it isn’t.",
    "In his final written work, Discourses and Mathematical Demonstrations Relating to Two New Sciences (1638), the legendary Italian polymath Galileo Galilei proposed a mathematical paradox based on the relationships between different sets of numbers. On the one hand, he proposed, there are square numbers—like 1, 4, 9, 16, 25, 36, and so on. On the other, there are those numbers that are not squares—like 2, 3, 5, 6, 7, 8, 10, and so on. Put these two groups together, and surely there have to be more numbers in general than there are just square numbers—or, to put it another way, the total number of square numbers must be less than the total number of square and non-square numbers together. However, because every positive number has to have a corresponding square and every square number has to have a positive number as its square root, there cannot possibly be more of one than the other.",
    "A man went back in time to murder his grandfather before he met his grandmother. Then how did he exist?"
  ]